PGM        PARM(&ORDERID)
             DCL        VAR(&ORDERID) TYPE(*CHAR) LEN(10)
             DCLF       FILE(INVHDR)

             CALL       PGM(CBIBILLP) PARM(&ORDERID)
             CALLPRC    PRC(CBIAUDLOG)
ENDPGM
