PGM
             CRTBNDDIR  BNDDIR(CBISHARED)
             MONMSG     CPF0000

             ADDBNDDIRE BNDDIR(CBISHARED) +
                          OBJ((CBIAUDLOG *SRVPGM *IMMED))
             MONMSG     CPF0000

             ADDBNDDIRE BNDDIR(CBISHARED) +
                          OBJ((CBITAXSRV *SRVPGM *IMMED))
             MONMSG     CPF0000

             CRTSRVPGM  SRVPGM(CBIAUDLOG) +
                          SRCMBR(CBISHARED)
             MONMSG     CPF0000

             CRTSRVPGM  SRVPGM(CBITAXSRV) +
                          SRCMBR(CBISHARED)
             MONMSG     CPF0000
ENDPGM
